SaludTeIntegra.WebApi/SaludTeIntegra.WebApi/Web References/ServicioVisor/visor_clService.wsdl

<?xml version="1.0" encoding="utf-8"?>
<definitions xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:tns="http://metodos.visor_cl.saydex.custom.com/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" name="visor_clService" targetNamespace="http://metodos.visor_cl.saydex.custom.com/" xmlns="http://schemas.xmlsoap.org/wsdl/">
  <types>
    <xsd:schema>
      <xsd:import schemaLocation="http://172.16.0.122:8111/services/Visor_CL?xsd=1" namespace="http://metodos.visor_cl.saydex.custom.com/" />
    </xsd:schema>
  </types>
  <message name="ObtenerURLVisorHCC">
    <part name="parameters" element="tns:ObtenerURLVisorHCC" />
  </message>
  <message name="ObtenerURLVisorHCCResponse">
    <part name="parameters" element="tns:ObtenerURLVisorHCCResponse" />
  </message>
  <message name="Exception">
    <part name="fault" element="tns:Exception" />
  </message>
  <portType name="visor_cl">
    <operation name="ObtenerURLVisorHCC">
      <input wsam:Action="http://metodos.visor_cl.saydex.custom.com/visor_cl/ObtenerURLVisorHCCRequest" message="tns:ObtenerURLVisorHCC" />
      <output wsam:Action="http://metodos.visor_cl.saydex.custom.com/visor_cl/ObtenerURLVisorHCCResponse" message="tns:ObtenerURLVisorHCCResponse" />
      <fault wsam:Action="http://metodos.visor_cl.saydex.custom.com/visor_cl/ObtenerURLVisorHCC/Fault/Exception" name="Exception" message="tns:Exception" />
    </operation>
  </portType>
  <binding name="visor_clPortBinding" type="tns:visor_cl">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <operation name="ObtenerURLVisorHCC">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
      <fault name="Exception">
        <soap:fault use="literal" name="Exception" namespace="" />
      </fault>
    </operation>
  </binding>
  <service name="visor_clService">
    <port name="visor_clPort" binding="tns:visor_clPortBinding">
      <soap:address location="http://172.16.0.122:8111/services/Visor_CL" />
    </port>
  </service>
</definitions>